###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID vlsi)
#  Generated on:      Sat May 23 23:41:04 2026
#  Design:            gpu
#  Command:           saveDesign DESIGN/route_design_setup_fix.inn
###############################################################
current_design gpu
create_clock [get_ports {clk}]  -name clk -period 4.500000 -waveform {0.000000 2.250000}
set_propagated_clock  [get_clocks {clk}]
set_max_transition -clock_path 0.75  [get_clocks {clk}]
set_max_transition -data_path 1.5  [get_clocks {clk}]
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_wire_load_mode enclosed
set_max_fanout 30  [get_designs {gpu}]
set_input_delay -add_delay 0.8 -max -clock [get_clocks {clk}] [get_ports {reset}]
set_output_delay -add_delay 0.8 -max -clock [get_clocks {clk}] [get_ports {done}]
set_clock_uncertainty 0.03 [get_clocks {clk}]
set_false_path  -from [get_ports {reset}] 
