###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID vlsi)
#  Generated on:      Thu May 21 12:53:07 2026
#  Design:            gpu
#  Command:           saveDesign DESIGN/placeinit.inn
###############################################################
current_design gpu
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 2.200000 -waveform {0.000000 1.000000}
set_clock_transition  -rise -min 0.05 [get_clocks {clk}]
set_clock_transition  -rise -max 0.05 [get_clocks {clk}]
set_clock_transition  -fall -min 0.05 [get_clocks {clk}]
set_clock_transition  -fall -max 0.05 [get_clocks {clk}]
set_wire_load_mode enclosed
set_max_fanout 20  [get_designs {gpu}]
set_input_delay -add_delay 0.8 -max -clock [get_clocks {clk}] [get_ports {reset}]
set_output_delay -add_delay 0.8 -max -clock [get_clocks {clk}] [get_ports {done}]
set_clock_uncertainty 0.005 [get_clocks {clk}]
set_false_path  -from [get_ports {reset}] 
